# DataFrame

## a:most commonly wsed data structure in pandas.
## b:is a 2-D labelled data structure with columns of different types.
## c:represent and work with tabular data
## d:accepts different kinds of input
## like:listdict,series,numpy ndarrays,another data frame

In [19]:
import pandas as pd
import numpy as np

In [20]:
d=pd.DataFrame([9,3,4,5,6])               #column indexing by default starts from zero.
print d

   0
0  9
1  3
2  4
3  5
4  6

In [21]:
d=pd.DataFrame([9,3,4,5,6],index=['a','b','c','d','e'],columns=['col_1'])      #passing of list
print d

   col_1
a      9
b      3
c      4
d      5
e      6

In [22]:
data=[['a',10],['b',34],['c',7]]                             #passing list of lists
e=pd.DataFrame(data,columns=['Name','Age'])
print e

  Name  Age
0    a   10
1    b   34
2    c    7

In [23]:
d={'name':['ravi','rohan','roy'],'marks':[34,56,23]}                 #passing a dictionary
df=pd.DataFrame(d,index=['stu1','stu2','stu3'])
print df

      marks   name
stu1     34   ravi
stu2     56  rohan
stu3     23    roy

In [24]:
a=np.array([[1,2,3],[4,5,6]])           #2D list
pd.DataFrame(a,columns=['A','B','C'],index=['First','Second'])  
#a.shape
#a.ndim

        A  B  C
First   1  2  3
Second  4  5  6

# Column Selection Deletion

In [25]:
df['marks']

stu1    34
stu2    56
stu3    23
Name: marks, dtype: int64

In [26]:
type(df['marks'])        #its an object of series class

pandas.core.series.Series

In [27]:
df['marks'].values          #will be shown in the form of an array

array([34, 56, 23], dtype=int64)

# ---------

# If no columns are passed,the columns will be the sorted list of dictionary keys

In [10]:
f=[{'a':1,'c':2},{'b':4,'a':45,'c':23}]        #b converted to NaN and thus all further data of b onverted to float
df=pd.DataFrame(f,index=['First','Second'])     
print df

         a    b   c
First    1  NaN   2
Second  45  4.0  23

In [11]:
f=[{'a':1,'c':2}]
df=pd.DataFrame(f,index=['first'])
print df

       a  c
first  1  2

# ----------

In [28]:
df['location']={'a','b','c'}

In [29]:
df

      marks   name location
stu1     34   ravi        a
stu2     56  rohan        c
stu3     23    roy        b

In [30]:
df['location']=pd.Series(['a','b','c'])

In [31]:
df             #NaN will be shown because we didnt give the indexes and by default indexes were 0 1 2 and they were not here.

      marks   name location
stu1     34   ravi      NaN
stu2     56  rohan      NaN
stu3     23    roy      NaN

In [32]:
df['location']=pd.Series(['a','b','c'],index=df.index)

In [33]:
df      #now mapping the indexes.

      marks   name location
stu1     34   ravi        a
stu2     56  rohan        b
stu3     23    roy        c

In [34]:
df['age']=[12,34,21]
df

      marks   name location  age
stu1     34   ravi        a   12
stu2     56  rohan        b   34
stu3     23    roy        c   21

In [35]:
#to sort the column in ascending order
df.sort_index(ascending=True,inplace=True,axis=1)       #inplace true implies impact traced back to the data frame
df

      age location  marks   name
stu1   12        a     34   ravi
stu2   34        b     56  rohan
stu3   21        c     23    roy

# Deletion

In [ ]:
del df['age']

In [ ]:
df

In [ ]:
df.drop('location',inplace=True,axis=1)      #if we wanna delete multiple columns pass list of column names

In [ ]:
df

In [ ]:
df.drop(['stu3'],inplace=True)            #row deletion
df

In [ ]:
df['new']=(df['marks'].values)+df['marks']*2   #if .values not used then taken as series otherwise inserted in array
df

In [ ]:
#inserting a scalar value
df['subject']='Python'
df

# By default column get inserted at the end. The insert function is available to inserty at a particular position.

In [ ]:
df.insert(0,'enroll no',[101,102])
df

# Indexing Selection

In [ ]:
df.loc['stu1']         #entries of student 1

In [ ]:
df.iloc[1]      #searching location by index

In [ ]:
df[:2]

In [ ]:
df[df['marks']==56]

In [ ]:
df['marks']==56

In [ ]:
df.loc[df['marks']==56]

In [ ]:
df[df['marks']>30]

# Adding Row

In [ ]:
df.loc['stu4']=[104,70,'Ravi',45,'django']
df.loc['stu5']=[105,80,'Rahul',84,'ML']

In [ ]:
df

# Multiple Additions

In [ ]:
df.loc[(df['marks']>30) & (df['name']=='rohan')]             #it is case sensitive

In [ ]:
#df.loc[df['name'].isin(['ravi','Mohan'])]
#df.loc[(df['name']=='ravi') | (df['name']=='Mohan')]
df[(df['marks']>30) & (df['name']=='ravi')]

In [ ]:
# The Pandas equivalent to
# select*from table where column name=some value